posts/2025-11-26-rime-color-scheme-design-rules.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>RIME Color Scheme Design Rules</title>
<meta name="description" content="Design rules of RIME’s color scheme with beautiful traditional chinese colors.">
<meta name="keywords" content="Themes, RIME">
<meta name="generator" content="Org Mode">
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="manifest" href="/site.webmanifest">
<link rel="stylesheet" type="text/css" href="/css/main.bundle.min.css">
</head>
<body>
<header id="preamble" class="status">
<div class="site-header">
  <a class="site-title" href="/">Chuck</a>
  <div class="site-nav">
    <div id="menu-list" class="main-menu">
      <a href="/posts/">Posts</a>
      <a href="/about.html">About</a>
    </div>
    <button aria-label="Search" onclick="window.location.href='/search.html';">
      <svg width="20" height="20" viewBox="0 0 24 24">
        <path fill="currentcolor" d="M23.822 20.88l-6.353-6.354c.93-1.465 1.467-3.2 1.467-5.059.001-5.219-4.247-9.467-9.468-9.467s-9.468 4.248-9.468 9.468c0 5.221 4.247 9.469 9.468 9.469 1.768 0 3.421-.487 4.839-1.333l6.396 6.396 3.119-3.12zm-20.294-11.412c0-3.273 2.665-5.938 5.939-5.938 3.275 0 5.94 2.664 5.94 5.938 0 3.275-2.665 5.939-5.94 5.939-3.274 0-5.939-2.664-5.939-5.939z"></path>
      </svg>
    </button>
    <button id="appearance-switcher" aria-label="Appearance Switcher">
      <svg id="moon" width="20" height="20" viewBox="0 0 512 512">
        <path fill="currentcolor" d="M32 256C32 132.2 132.3 32 255.8 32c11.36.0 29.7 1.668 40.9 3.746 9.616 1.777 11.75 14.63 3.279 19.44C245 86.5 211.2 144.6 211.2 207.8c0 109.7 99.71 193 208.3 172.3 9.561-1.805 16.28 9.324 10.11 16.95C387.9 448.6 324.8 480 255.8 480 132.1 480 32 379.6 32 256z">
        </path>
      </svg>
      <svg id="sun" width="20" height="20" viewBox="0 0 512 512">
        <path fill="currentcolor" d="M256 159.1c-53.02.0-95.1 42.98-95.1 95.1s41.2 96.9 95.1 96.9 95.1-42.98 95.1-95.1S309 159.1 256 159.1zM509.3 347l-63.2-91.9 63.15-91.01c6.332-9.125 1.104-21.74-9.826-23.72l-109-19.7-19.7-109c-1.975-10.93-14.59-16.16-23.72-9.824L256 65.89 164.1 2.736c-9.125-6.332-21.74-1.107-23.72 9.824L121.6 121.6 12.56 141.3C1.633 143.2-3.596 155.9 2.736 164.1L65.89 256 2.74 347.01c-6.332 9.125-1.105 21.74 9.824 23.72l109 19.7 19.7 109c1.975 10.93 14.59 16.16 23.72 9.824L256 446.1l91.01 63.15c9.127 6.334 21.75 1.107 23.72-9.822l19.7-109 109-19.7C510.4 368.8 515.6 356.1 509.3 347zM256 383.1c-70.69.0-127.1-57.31-127.1-127.1.0-70.69 57.31-127.1 127.1-127.1S383.1 186.2 383.1 256c0 70.7-56.4 127.1-127.1 127.1z">
        </path>
      </svg>
    </button>
    <button id="menu-button" aria-label="Menu">
      <svg width="20" height="20" viewBox="0 0 448 512">
        <path fill="currentcolor" d="M0 96C0 78.33 14.33 64 32 64H416c17.7.0 32 14.33 32 32 0 17.7-14.3 32-32 32H32C14.33 128 0 113.7.0 96zM0 256c0-17.7 14.33-32 32-32H416c17.7.0 32 14.3 32 32s-14.3 32-32 32H32c-17.67.0-32-14.3-32-32zM416 448H32c-17.67.0-32-14.3-32-32s14.33-32 32-32H416c17.7.0 32 14.3 32 32s-14.3 32-32 32z">
        </path>
      </svg>
    </button>
  </div>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">RIME Color Scheme Design Rules</h1>
</header><p>
<a href="https://github.com/rime">RIME</a> is a modular, extensible input method engine in cross-platform C++ code, built on top of open-source technologies.
</p>

<p>
For light schemes:
</p>
<ul class="org-ul">
<li>color_format: rgba</li>
<li>text_color: 0x000000 # 默认文字颜色</li>
<li>comment_text_color: 0x717171 # 注释文字颜色，0x8E8E8E的反色</li>
<li>label_color: 0x8E8E8E # 标签文字颜色</li>
<li>back_color: 0xFFFFFF # 候选窗背景色</li>
<li>border_color: 0xE7E7E7 # 候选窗边框颜色</li>
<li>hilited_candidate_text_color: 0xC02C38 # 高亮候选文字颜色，根据个人喜好选择</li>
<li>hilited_candidate_back_color: 0xC02C3826 # 高亮候选背景颜色，高亮候选文字颜色不透明度20%，alpha值约为38/0x26</li>
<li>hilited_label_color: 0xC02C38 # 高亮候选的标签颜色，与高亮候选文字颜色一致</li>
<li>hilited_comment_text_color: 0xC02C38 # 高亮候选的注释颜色，与高亮候选文字颜色一致</li>
<li>candidate_text_color: 0x454545 # 候选文字颜色</li>
<li>candidate_back_color: 0xFFFFFF # 非高亮候选背景颜色</li>
</ul>

<p>
For dark schemes:
</p>
<ul class="org-ul">
<li>color_format: rgba</li>
<li>text_color: 0xFFFFFF # 默认文字颜色</li>
<li>comment_text_color: 0x8E8E8E # 注释文字颜色</li>
<li>label_color: 0x717171 # 标签文字颜色</li>
<li>back_color: 0x000000 # 候选窗背景色</li>
<li>border_color: 0x000000 # 候选窗边框颜色</li>
<li>hilited_candidate_text_color: 0xFFFFFF # 高亮候选文字颜色</li>
<li>hilited_candidate_back_color: 0xC02C38 # 高亮候选背景颜色，与亮色主题中高亮候选文字颜色一致</li>
<li>hilited_label_color: 0xFFFFFF # 高亮候选的标签颜色，与高亮候选文字颜色一致</li>
<li>hilited_comment_text_color: 0xFFFFFF # 高亮候选的注释颜色，与高亮候选文字颜色一致</li>
<li>candidate_text_color: 0xBABABA # 候选文字颜色，0x454545的反色</li>
<li>candidate_back_color: 0x000000 # 非高亮候选背景颜色</li>
</ul>

<p>
I like traditional chinese colors very much, here are many choices:
</p>
<ul class="org-ul">
<li><a href="https://colors.ichuantong.cn/">https://colors.ichuantong.cn/</a></li>
<li><a href="https://zhongguose.com/">https://zhongguose.com/</a></li>
<li><a href="https://colors.masantu.com/">https://colors.masantu.com/</a></li>
<li><a href="https://boxingp.github.io/traditional-chinese-colors/">https://boxingp.github.io/traditional-chinese-colors/</a></li>
</ul>

<p>
Customize color schemes refer to this <a href="https://github.com/rime/weasel/wiki/%E5%AE%9A%E5%88%B6%E5%B0%8F%E7%8B%BC%E6%AF%AB%E9%85%8D%E8%89%B2">wiki</a>.
</p>
</main>
<footer id="postamble" class="status">
<div class="site-footer">
  <p>&copy 2026 Chuck</p>
  <p>Powered by <a href="https://www.gnu.org/software/emacs/">Emacs</a></p>
</div>
<a href="#top" class="top-link" id="top-link" style="visibility: hidden; opacity: 0;">
  <svg xmlns="http://www.w3.org/2000/svg" height="24px" width="24px" viewBox="0 -960 960 960" fill="currentcolor">
    <path d="M440-160v-487L216-423l-56-57 320-320 320 320-56 57-224-224v487h-80Z"></path>
  </svg>
</a>
</footer>
</body>
</html>
